       identification division.
       program-id. "HW".
       author. Thomas.
       
       procedure division.
           display " HELLO WORLD".
       stop run.


           